**Missing Values Analysis**

In [2]:
# Step 1 import required packages
import numpy as np
import pandas as pd

In [6]:
#Lets create a dataset with missing values
dict1={'Names':['Ramesh','Suresh','Satish',np.nan],
    'Ages':[30,31,np.nan,32],
        'City':[np.nan,'Hyd','Pune','Chennai']}
d1=pd.DataFrame(dict1)
d1

    Names  Ages     City
0  Ramesh  30.0      NaN
1  Suresh  31.0      Hyd
2  Satish   NaN     Pune
3     NaN  32.0  Chennai

In [7]:
d1.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
dict2={'Names':['Ramesh','Suresh','Satish',None],
    'Ages':[30,31,None,32],
        'City':[None,'Hyd','Pune','Chennai']}
d2=pd.DataFrame(dict2)
d2

    Names  Ages     City
0  Ramesh  30.0     None
1  Suresh  31.0      Hyd
2  Satish   NaN     Pune
3    None  32.0  Chennai

In [16]:
d2.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [1]:
dict3={'Names':['Ramesh','Suresh','Satish',Null],
    'Ages':[30,31,Null,32],
        'City':[Null,'Hyd','Pune','Chennai']}
d3=pd.DataFrame(dict3)
d3

NameError: name 'Null' is not defined

In [11]:
d1.fillna(method='pad')

    Names  Ages     City
0  Ramesh  30.0      NaN
1  Suresh  31.0      Hyd
2  Satish  31.0     Pune
3  Satish  32.0  Chennai

In [12]:
dict1={'Names':['Ramesh','Suresh','Satish',np.nan],
    'Ages':[30,31,np.nan,32],
        'City':[np.nan,'Hyd','Pune','Chennai']}
d1=pd.DataFrame(dict1)
d1.fillna(method='pad',axis=0)

    Names  Ages     City
0  Ramesh  30.0      NaN
1  Suresh  31.0      Hyd
2  Satish  31.0     Pune
3  Satish  32.0  Chennai

In [13]:
dict1={'Names':['Ramesh','Suresh','Satish',np.nan],
    'Ages':[30,31,np.nan,32],
        'City':[np.nan,'Hyd','Pune','Chennai']}
d1=pd.DataFrame(dict1)
d1.fillna(method='pad',axis=1)

    Names    Ages     City
0  Ramesh    30.0     30.0
1  Suresh    31.0      Hyd
2  Satish  Satish     Pune
3     NaN    32.0  Chennai

In [14]:
dict1={'Names':['Ramesh','Suresh','Satish',np.nan],
    'Ages':[30,31,np.nan,32],
        'City':[np.nan,'Hyd','Pune','Chennai']}
d1=pd.DataFrame(dict1)
d1.fillna(method='bfill')

    Names  Ages     City
0  Ramesh  30.0      Hyd
1  Suresh  31.0      Hyd
2  Satish  32.0     Pune
3     NaN  32.0  Chennai